go-go-golems/esp32-s3-m5/0101-esp32-p4-native-quickjs/sdkconfig.defaults
# 0101 — ESP32-P4 native QuickJS firmware.
# Baseline: 0099 P4 UART0/PSRAM, without WAMR.
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 board console: CH343 USB-UART bridge on UART0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Flash + PSRAM baseline for ESP32-P4NRW32.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Keep a roomy app partition for native QuickJS and future embedded JS/assets.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
